osuarez84/STM32F7_DMA_double_buff_TIM_DAC/Src/main.c
}



static void TransferM0CompleteCh1(DMA_HandleTypeDef *DmaHandle)
{
	/* Set the flags */
	// TODO
	HAL_GPIO_TogglePin(GPIOJ, GPIO_PIN_5);
}



static void TransferM1CompleteCh1(DMA_HandleTypeDef *DmaHandle)
{
	/* Set the flags */
	// TODO
	HAL_GPIO_TogglePin(GPIOJ, GPIO_PIN_13);
}


static void TransferM0CompleteCh2(DMA_HandleTypeDef *DmaHandle)
{
	/* Set the flags */
	// TODO
}



static void TransferM1CompleteCh2(DMA_HandleTypeDef *DmaHandle)
{
	/* Set the flags */
	// TODO
}


/* Funciones de la HAL modificadas ------------------------------------------ */
/* Función de la HAL Cube modificada para
 * poder trabajar con los doubles buffers disponibles
 * en la DMA y el envío de datos al DAC. */
HAL_StatusTypeDef HAL_DAC_Start_DMA_double_buff(DAC_HandleTypeDef* hdac, uint32_t Channel, uint32_t* pData, uint32_t* qData, uint32_t Length, uint32_t Alignment)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_DAC_CHANNEL(Channel));
  assert_param(IS_DAC_ALIGN(Alignment));

  /* Process locked */
  __HAL_LOCK(hdac);

  /* Change DAC state */
  hdac->State = HAL_DAC_STATE_BUSY;

  if(Channel == DAC_CHANNEL_1)
  {
    /* Set the DMA transfer complete callback for channel1 and the doubble
     * buffers */
	HAL_DMA_RegisterCallback(hdac->DMA_Handle1, HAL_DMA_XFER_CPLT_CB_ID,
			  TransferM0CompleteCh1);
	HAL_DMA_RegisterCallback(hdac->DMA_Handle1, HAL_DMA_XFER_M1CPLT_CB_ID,
			  TransferM1CompleteCh1);


    /* Set the DMA half transfer complete callback for channel1 */
    //hdac->DMA_Handle1->XferHalfCpltCallback = DAC_DMAHalfConvCpltCh1;

    /* Set the DMA error callback for channel1 */
    //hdac->DMA_Handle1->XferErrorCallback = DAC_DMAErrorCh1;

    /* Enable the selected DAC channel1 DMA request */
    hdac->Instance->CR |= DAC_CR_DMAEN1;

    /* Case of use of channel 1 */
    switch(Alignment)
    {
      case DAC_ALIGN_12B_R:
        /* Get DHR12R1 address */
        tmpreg = (uint32_t)&hdac->Instance->DHR12R1;
        break;
      case DAC_ALIGN_12B_L:
        /* Get DHR12L1 address */
        tmpreg = (uint32_t)&hdac->Instance->DHR12L1;
        break;
      case DAC_ALIGN_8B_R:
        /* Get DHR8R1 address */
        tmpreg = (uint32_t)&hdac->Instance->DHR8R1;
        break;
      default:
        break;
    }
  }
  else
  {
    /* Set the DMA transfer complete callback for channel2 */
	HAL_DMA_RegisterCallback(hdac->DMA_Handle2, HAL_DMA_XFER_CPLT_CB_ID,
				  TransferM0CompleteCh2);
	HAL_DMA_RegisterCallback(hdac->DMA_Handle2, HAL_DMA_XFER_M1CPLT_CB_ID,
				  TransferM1CompleteCh2);

    /* Set the DMA half transfer complete callback for channel2 */
    //hdac->DMA_Handle2->XferHalfCpltCallback = DAC_DMAHalfConvCpltCh2;

    /* Set the DMA error callback for channel2 */
    //hdac->DMA_Handle2->XferErrorCallback = DAC_DMAErrorCh2;

    /* Enable the selected DAC channel2 DMA request */
    hdac->Instance->CR |= DAC_CR_DMAEN2;

    /* Case of use of channel 2 */
    switch(Alignment)
    {
      case DAC_ALIGN_12B_R:
        /* Get DHR12R2 address */
        tmpreg = (uint32_t)&hdac->Instance->DHR12R2;
        break;
      case DAC_ALIGN_12B_L:
        /* Get DHR12L2 address */
        tmpreg = (uint32_t)&hdac->Instance->DHR12L2;
        break;
      case DAC_ALIGN_8B_R:
        /* Get DHR8R2 address */
        tmpreg = (uint32_t)&hdac->Instance->DHR8R2;
        break;
      default:
        break;
    }
  }

  /* Enable the DMA Stream */
  if(Channel == DAC_CHANNEL_1)
  {
    /* Enable the DAC DMA underrun interrupt */
    __HAL_DAC_ENABLE_IT(hdac, DAC_IT_DMAUDR1);

    /* Enable the DMA double buffer Stream */
    HAL_DMAEx_MultiBufferStart_IT(hdac->DMA_Handle1, (uint32_t)pData, tmpreg,
    		(uint32_t)qData, Length);

  }
  else
  {
    /* Enable the DAC DMA underrun interrupt */
    __HAL_DAC_ENABLE_IT(hdac, DAC_IT_DMAUDR2);

    /* Enable the DMA double buffer Stream */
    HAL_DMAEx_MultiBufferStart_IT(hdac->DMA_Handle2, (uint32_t)pData, tmpreg,
    		(uint32_t)qData, Length);
  }

  /* Enable the Peripheral */
  __HAL_DAC_ENABLE(hdac, Channel);

  /* Process Unlocked */
  __HAL_UNLOCK(hdac);

  /* Return function status */
  return HAL_OK;
}




/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
